Revit 2024 API
BuiltInFailures.PipingFailures.PartNotFoundDueToNoPipeConnectedWarning Property
 "In order to find a matching part, the fitting has to be connected to a pipe."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId PartNotFoundDueToNoPipeConnectedWarning { get; }
Visual Basic
Public Shared ReadOnly Property PartNotFoundDueToNoPipeConnectedWarning As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ PartNotFoundDueToNoPipeConnectedWarning {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace